# 📌오락실 게임 만들기

import pygame  # 파이썬 라이브러리인 pygame을 이용

#############################################################################################

## 기본 초기화 (반드시 해야 하는 것들)

pygame.init()

# 화면 크기 설정
screen_width = 480    # 가로크기
screen_height = 640   # 세로크기
screen = pygame.display.set_mode((screen_width, screen_height))  # 지정해준 크기로 화면 크기설정

# 화면 타이틀 설정
pygame.display.set_caption("게임 이름")

# FPS
clock = pygame.time.Clock()

#############################################################################################

## 1. 사용자 게임 초기화 (배경화면, 게임이미지, 좌표, 속도, 폰트 등)

running = True
while running:
    dt = clock.tick(30)
    
    ## 2. 이벤트 처리 (키보드, 마우스 등)
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            running = False

    ## 3. 게임 캐릭터 위치 정의

    ## 4. 충돌 처리
    
    ## 5. 화면에 그리기
    
    # 게임화면 업데이트
    pygame.display.update()

# pygame 종료
pygame.quit()

#############################################################################################